#include <stdio.h>
#include <windows.h>

#include "lib.h"

void EnemyMissileDraw(void)
{
	SetColor(GREEN);
	gotoxy(0, 22);
	printf("                 ¡×                                   \n");
}

/* ========================================================================== */

/* Àû Ç¥½Ã */
void EnemyDraw(void)
{
	SetColor(WHITE);
	gotoxy(0, 10);
	printf("      ¢Á¢Á ¢Á¢Á ¢Á¢Á ¢Á¢Á ¢Á¢Á ¢Á¢Á ¢Á¢Á ¢Á¢Á ¢Á¢Á    \n");
	printf("                                                      \n");
	printf("      ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã    \n");
	printf("                                                      \n");
	printf("      ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã ¢Ã¢Ã    \n");
	printf("                                                      \n");
	printf("      ¡á¡á ¡á¡á ¡á¡á ¡á¡á ¡á¡á ¡á¡á ¡á¡á ¡á¡á ¡á¡á    \n");
	printf("                                                      \n");
	printf("      ¡á¡á ¡á¡á ¡á¡á ¡á¡á ¡á¡á ¡á¡á ¡á¡á ¡á¡á ¡á¡á    \n");
}

/* ========================================================================== */